GroundStudio/Jade/boards.txt
menu.version=Version

jade-nanoplus.name=GroundStudio Jade Nano+
jade-nanoplus.upload.tool=arduino:avrdude
jade-nanoplus.upload.protocol=arduino
jade-nanoplus.upload.maximum_size=32256
jade-nanoplus.upload.maximum_data_size=2048

jade-nanoplus.bootloader.tool=arduino:avrdude
jade-nanoplus.bootloader.low_fuses=0xFF
jade-nanoplus.bootloader.high_fuses=0xDE
jade-nanoplus.bootloader.unlock_bits=0xFF
jade-nanoplus.bootloader.lock_bits=0xCF

jade-nanoplus.build.mcu=atmega328pb
jade-nanoplus.build.board=AVR_JADE_NANOPLUS
jade-nanoplus.build.core=arduino:arduino
jade-nanoplus.build.variant=jade-nanoplus

##############################################################

jade-nanoplus.upload.speed=115200
jade-nanoplus.bootloader.extended_fuses=0xF4
jade-nanoplus.bootloader.file=optiboot/optiboot_atmega328pb_16mhz.hex
jade-nanoplus.build.f_cpu=16000000L




